{
    "data": [
        {
            "name": "Adventurer",
            "key": "adventurer",
            "flower_description": "A resilient flower that survived the harsh environment of an ancient city. It is now proudly worn like a medal.",
            "feather_description": "The feather of an exotic bird rarely seen on this continent.",
            "sand_description": "It's easy to lose track of time when you're adventuring where the sun doesn't shine, whether that's the depths of the abyss or the ruins of a lost city.",
            "goblet_description": "The spoils of one of an adventurer's many expeditions. Though a little damaged, it is still an excellent find.",
            "circlet_description": "A cloth garment worn at the forehead. Though soaked in sweat and covered in dust, it still beams with an adventurer's pride.",
            "flower_name": "Adventurer's Flower",
            "feather_name": "Adventurer's Tail Feather",
            "sand_name": "Adventurer's Pocket Watch",
            "goblet_name": "Adventurer's Golden Goblet",
            "circlet_name": "Adventurer's Bandana",
            "two_pc_bonus": "Max HP increased by 1000.",
            "four_pc_bonus": "Opening a chest regenerates 30% Max HP over 5s.",
            "rarity_min": 1,
            "rarity_max": 3,
            "release_version": 1.0
        },
        {
            "name": "Archaic Petra",
            "key": "archaic-petra",
            "flower_description": "A flower born of the minerals and rocks of cliffside cracks. The way its petals blow in the wind makes it seem alive.",
            "feather_description": "A hard feather from a large seacliff hawk. The basalt tip of the feather sometimes glistens with a cool dew.",
            "sand_description": "A sundial carved from a single, large piece of jade. It's lined with a pattern that silently records the passage of time.",
            "goblet_description": "A resplendent yet dignified wine goblet, once filled to the brim in an era long gone.",
            "circlet_description": "A solemn mask exquisitely carved from basalt. Its hollow eyes stare ahead expressionless and cold.",
            "flower_name": "Flower of Creviced Cliff",
            "feather_name": "Feather of Jagged Peaks",
            "sand_name": "Sundial of Enduring Jade",
            "goblet_name": "Goblet of Chiseled Crag",
            "circlet_name": "Mask of Solitude Basalt",
            "two_pc_bonus": "Geo DMG Bonus +15%",
            "four_pc_bonus": "Upon obtaining an Elemental Shard created through a Crystallize Reaction, all party members gain 35% DMG Bonus for that particular element for 10s. Only one form of Elemental DMG Bonus can be gained in this manner at any one time.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.0
        },
        {
            "name": "Berserker",
            "key": "berserker",
            "flower_description": "An exquisite flower that has been dyed red. It represents the qualities of the Berserker.",
            "feather_description": "An indigo feather from a legendary raven, part of which has been dyed crimson red.",
            "sand_description": "An instrument with an eternal flow that continues mercilessly within, reminding the Berserker of the limited time he has left — both on the battlefield as well as in the world.",
            "goblet_description": "A goblet made from the bone of an unknown beast. It was taken as a trophy after some deadly encounter.",
            "circlet_description": "A hideous iron mask that has been left half-shattered from vicious battles.",
            "flower_name": "Berserker's Rose",
            "feather_name": "Berserker's Indigo Feather",
            "sand_name": "Berserker's Timepiece",
            "goblet_name": "Berserker's Bone Goblet",
            "circlet_name": "Berserker's Battle Mask",
            "two_pc_bonus": "CRIT Rate +12%",
            "four_pc_bonus": "When HP is below 70%, CRIT Rate increases by an additional 24%.",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Blizzard Strayer",
            "key": "blizzard-strayer",
            "flower_description": "A long-extinct flower, covered in beads of frost, that once grew on the glaciers. There was a time when even the proudest and most arrogant warriors bowed before it.",
            "feather_description": "A feather that exudes a chilly aura. One can almost feel the turbulent winds that brought it here, wailing over snow-covered plains and between frosty peaks.",
            "sand_description": "A timepiece from a nation of old that waited for their warriors' return. What flows inside is not sand, but bits of ice that never melt.",
            "goblet_description": "A cup carved out of ice that is as chilly and biting as winter. Its former master would drink an unfreezable liquor from it.",
            "circlet_description": "The crown of an ancient hero who dreamt of conquering the cold. It is proof of its former master's bravery in facing the bone-chilling cold of winter.",
            "flower_name": "Snowswept Memory",
            "feather_name": "Icebreaker's Resolve",
            "sand_name": "Frozen Homeland's Demise",
            "goblet_name": "Frost-Weaved Dignity",
            "circlet_name": "Broken Rime's Echo",
            "two_pc_bonus": "Cryo DMG Bonus +15%",
            "four_pc_bonus": "When a character attacks an opponent affected by Cryo, their CRIT Rate is increased by 20%. If the opponent is Frozen, CRIT Rate is increased by an additional 20%.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.2
        },
        {
            "name": "Bloodstained Chivalry",
            "key": "bloodstained-chivalry",
            "flower_description": "A dried flower stained black with blood and now as hard as steel. Probably some sort of a memento for its former master.",
            "feather_description": "A raven feather pinned to a knight's cape. Countless bloodstains have dyed it pitch black.",
            "sand_description": "A timepiece once used by a knight. The liquid inside has dried up, rendering it useless.",
            "goblet_description": "The dark metallic vessel owned by the Bloodstained Knight. Its exterior has been stained as black as the night by smoke and coagulated blood.",
            "circlet_description": "The iron mask the knight used to conceal their identity. Many have speculated about the face behind the mask.",
            "flower_name": "Bloodstained Flower of Iron",
            "feather_name": "Bloodstained Black Plume",
            "sand_name": "Bloodstained Final Hour",
            "goblet_name": "Bloodstained Chevalier's Goblet",
            "circlet_name": "Bloodstained Iron Mask",
            "two_pc_bonus": "Physical DMG Bonus +25%",
            "four_pc_bonus": "After defeating an opponent, increases Charged Attack DMG by 50%, and reduces its Stamina cost to 0 for 10s.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.0
        },
        {
            "name": "Brave Heart",
            "key": "brave-heart",
            "flower_description": "A simple flower brooch that is a keepsake from someone's first adventure.",
            "feather_description": "A shimmering feather from a songbird that brings a nudge of courage to its wearer.",
            "sand_description": "A dated miniature hourglass that serves no practical purpose. It seems as elusive as time itself.",
            "goblet_description": "A crude wooden vessel filled only with memories.",
            "circlet_description": "A rough-and-ready laurel wreath that seems as precious as a king's golden crown.",
            "flower_name": "Medal of the Brave",
            "feather_name": "Prospect of the Brave",
            "sand_name": "Fortitude of the Brave",
            "goblet_name": "Outset of the Brave",
            "circlet_name": "Crown of the Brave",
            "two_pc_bonus": "ATK +18%.",
            "four_pc_bonus": "Increases DMG by 30% against opponents with more than 50% HP.",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Crimson Witch of Flames",
            "key": "crimson-witch-of-flames",
            "flower_description": "A flower touched by the witch who once dreamt of burning away all the demons in the world. The anonymous flames affectionately caress the hands of those who touch it.",
            "feather_description": "A bird feather touched by the witch who once dreamt of burning away all the demons in the world. Its eternal flame burns hot.",
            "sand_description": "A timepiece worn by the witch who dreamt of burning away all the demons in the world. The years the witch dedicated to the flames flow within.",
            "goblet_description": "A flame-spitting urn left behind by the Crimson Witch of Flames, who once dreamt of burning away all the demons in the world. The fire in the urn burns eternally, as did its former master.",
            "circlet_description": "A hat once worn by the witch who dreamt of burning away all the demons in the world. The large brim blocked her sight.",
            "flower_name": "Witch's Flower of Blaze",
            "feather_name": "Witch's Ever-Burning Plume",
            "sand_name": "Witch's End Time",
            "goblet_name": "Witch's Heart Flames",
            "circlet_name": "Witch's Scorching Hat",
            "two_pc_bonus": "Pyro DMG Bonus +15%",
            "four_pc_bonus": "Increases Overloaded and Burning, and Burgeon DMG by 40%. Increases Vaporize and Melt DMG by 15%. Using Elemental Skill increases the 2-Piece Set Bonus by 50% of its starting value for 10s. Max 3 stacks.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.0
        },
        {
            "name": "Deepwood Memories",
            "key": "deepwood-memories",
            "flower_description": "This lovely gold-plated flower was plucked from the crown of the ruler of the forest.",
            "feather_description": "An emerald leaf as fluffy as a feather. Plucked from the raiment of a forest scholar.",
            "sand_description": "Such timepieces are used by those who dedicate themselves to the way of the wise. These timepieces do not contain lifeless sand, but instead play host to tiny mustard seeds.",
            "goblet_description": "This was originally an oil lamp in the style of the desert realm, but has since sprouted fluorescent green leaves.",
            "circlet_description": "This crown was bestowed by the deity with dominion over plants and trees. It was an heirloom of the royal house of the labyrinth. It was, at last, made the inheritance of the king's attendant.",
            "flower_name": "Labyrinth Wayfarer",
            "feather_name": "Scholar of Vines",
            "sand_name": "A Time of Insight",
            "goblet_name": "Lamp of the Lost",
            "circlet_name": "Laurel Coronet",
            "two_pc_bonus": "Dendro DMG Bonus +15%",
            "four_pc_bonus": "After Elemental Skills or Bursts hit opponents, the targets' Dendro RES will be decreased by 30% for 8s. This effect can be triggered even if the equipping character is not on the field.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 3.0
        },
        {
            "name": "Defender's Will",
            "key": "defenders-will",
            "flower_description": "An iris that was cherished by the Guardian. Unfortunately, the chance never came for it to be given to whom the Guardian loved.",
            "feather_description": "A feather-shaped brooch that symbolizes someone's yearning to defend others like a shield.",
            "sand_description": "A small timekeeping gadget. On moonless nights, it was the only way its former owner could know the time.",
            "goblet_description": "A metal vessel that can be filled with a drink to dispel the loneliness of the long watch.",
            "circlet_description": "A fabric band dyed indigo by the darkness of night. Can also double as a bandage in the event of an emergency.",
            "flower_name": "Guardian's Flower",
            "feather_name": "Guardian's Sigil",
            "sand_name": "Guardian's Clock",
            "goblet_name": "Guardian's Vessel",
            "circlet_name": "Guardian's Band",
            "two_pc_bonus": "DEF +30%",
            "four_pc_bonus": "For each different element present in your own party, the wearer's Elemental RES to that corresponding element is increased by 30%.",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Desert Pavilion Chronicle",
            "key": "desert-pavilion-chronicle",
            "flower_description": "An artificial flower that shimmers with a strange light. If you incline your ear to it, you can vaguely hear charming laughter issuing from within.",
            "feather_description": "A crystal-clear artificial feather that is one of the legacies of an ancient human realm. The cries of soaring eagles are also sealed within.",
            "sand_description": "An ancient mechanical clock. The Jinni fragments continue to emit light at its center and vibrate ever so slightly, as if to say something...",
            "goblet_description": "An ancient golden cup that is both marvelously and luxuriously wrought. Murmurings can be heard within its empty innards.",
            "circlet_description": "Earrings made from amber gold that shines with a strange light.",
            "flower_name": "The First Days of the City of Kings",
            "feather_name": "End of the Golden Realm",
            "sand_name": "Timepiece of the Lost Path",
            "goblet_name": "Defender of the Enchanting Dream",
            "circlet_name": "Legacy of the Desert High-Born",
            "two_pc_bonus": "Anemo DMG Bonus +15%.",
            "four_pc_bonus": "When Charged Attacks hit opponents, the equipping character's Normal Attack SPD will increase by 10% while Normal, Charged, and Plunging Attack DMG will increase by 40% for 15s.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 3.3
        },
        {
            "name": "Echoes of an Offering",
            "key": "echoes-of-an-offering",
            "flower_description": "A jade carved into the shape of a flower. A phantom scent, here one instant and gone the next, swirls around it.",
            "feather_description": "A jade ornament shaped like a leaf. It seems to have once had deep meaning between specific friends.",
            "sand_description": "A circular jade ornament. Legend has it that it was once used somewhere as a symbol for rituals to begin.",
            "goblet_description": "This teacup forever overflows with fresh water. Perhaps it was a gift from an adeptus, one of their relics, or just something they left behind.",
            "circlet_description": "A pair of earrings made from a single piece of jade. It has a most gentle texture.",
            "flower_name": "Soulscent Bloom",
            "feather_name": "Jade Leaf",
            "sand_name": "Symbol of Felicitation",
            "goblet_name": "Chalice of the Font",
            "circlet_name": "Flowing Rings",
            "two_pc_bonus": "ATK +18%.",
            "four_pc_bonus": "When Normal Attacks hit opponents, there is a 36% chance that it will trigger Valley Rite, which will increase Normal Attack DMG by 70% of ATK.This effect will be dispelled 0.05s after a Normal Attack deals DMG.If a Normal Attack fails to trigger Valley Rite, the odds of it triggering the next time will increase by 20%.This trigger can occur once every 0.2s.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 2.6
        },
        {
            "name": "Emblem of Severed Fate",
            "key": "emblem-of-severed-fate",
            "flower_description": "Legends has it that this ornate hand guard was once fitted upon a sword gifted to the oni who betrayed the Shogun.",
            "feather_description": "This was once the black feather of a certain tengu warrior, and was the treasured souvenir of an ancient swordsman.",
            "sand_description": "An exquisite seal cage patterned with pansies painted upon a black backdrop, decorated with shining inlaid seashells and intricate gold-work.",
            "goblet_description": "An intricately-designed wine vessel that a world-famous martial artist once drank from.",
            "circlet_description": "A sturdy and hard helmet worn as armor by a noble samurai.",
            "flower_name": "Magnificent Tsuba",
            "feather_name": "Sundered Feather",
            "sand_name": "Storm Cage",
            "goblet_name": "Scarlet Vessel",
            "circlet_name": "Ornate Kabuto",
            "two_pc_bonus": "Energy Recharge +20%",
            "four_pc_bonus": "Increases Elemental Burst DMG by 25% of Energy Recharge. A maximum of 75% bonus DMG can be obtained in this way.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 2.0
        },
        {
            "name": "Finale of the Deep Galleries",
            "key": "finale-of-the-deep-galleries",
            "flower_description": "An icy flower fashioned from northland jade. Over the course of its long life, its petals have crumbled to dust.",
            "feather_description": "A feathered accessory fashioned from northland jade that shimmers with an otherworldly glow.",
            "sand_description": "A pocket watch fashioned from northland jade. Its hands are forever frozen in the moment of its destruction.",
            "goblet_description": "A cup fashioned from northland jade. They say that the people of an ancient civilization once used it as a ceremonial vessel to make offerings to the heavens.",
            "circlet_description": "A helmet steeped in obsession, just like the mind of its previous owner. Its jade ornamentation seems to come from an age more ancient still.",
            "flower_name": "Deep Gallery's Echoing Song",
            "feather_name": "Deep Gallery's Distant Pact",
            "sand_name": "Deep Gallery's Moment of Oblivion",
            "goblet_name": "Deep Gallery's Bestowed Banquet",
            "circlet_name": "Deep Gallery's Lost Crown",
            "two_pc_bonus": "Cryo DMG Bonus +15%",
            "four_pc_bonus": "When the equipping Character has 0 Elemental Energy, Normal Attack DMG is increased by 60% and Elemental Burst DMG is increased by 60%. After the equipping character deals Normal Attack DMG, the aforementioned Elemental Burst effect will stop applying for 6s. After the equipping character deals Elemental Burst DMG, the aforementioned Normal Attack effect will stop applying for 6s. This effect can trigger even if the equipping character is off the field.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 5.5
        },
        {
            "name": "Flower of Paradise Lost",
            "key": "flower-of-paradise-lost",
            "flower_description": "An amethyst bloom that has been beautifully sculpted in the image of an ancient, extinct flower.",
            "feather_description": "A feather left behind by a long-extinct bird species. It was inlaid with gold and gems by the ancient adherents of the Goddess of Flowers.",
            "sand_description": "These sands no longer move no matter how you tilt the hourglass, now and forever defying the drift of time itself.",
            "goblet_description": "A small bottle made of purple crystal. An emerald cap keeps it tightly sealed.",
            "circlet_description": "A crown inlaid with amethyst and emerald. It seems to have been the headgear worn by ancient priests of the Goddess of Flowers.",
            "flower_name": "Ay-Khanoum's Myriad",
            "feather_name": "Wilting Feast",
            "sand_name": "A Moment Congealed",
            "goblet_name": "Secret-Keeper's Magic Bottle",
            "circlet_name": "Amethyst Crown",
            "two_pc_bonus": "Increases Elemental Mastery by 80.",
            "four_pc_bonus": "The equipping character's Bloom, Hyperbloom, and Burgeon reaction DMG are increased by 40%. Additionally, after the equipping character triggers Bloom, Hyperbloom, or Burgeon, they will gain another 25% bonus to the effect mentioned prior. Each stack of this lasts 10s. Max 4 stacks simultaneously. This effect can only be triggered once per second. The character who equips this can still trigger its effects when not on the field.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 3.3
        },
        {
            "name": "Fragment of Harmonic Whimsy",
            "key": "fragment-of-harmonic-whimsy",
            "flower_description": "An honorary medal in the shape of a blooming flower. Adorned with blue stone and gold, it was once bestowed upon immortals.",
            "feather_description": "A feather accessory carved in the shape of the wings of the golden bees of legend. They seem to flutter with the slightest breeze.",
            "sand_description": "A timepiece made in imitation of the wheel of fate. It ceased turning long ago.",
            "goblet_description": "A rhyton fired with copper as the base, that was once filled with fine wine from paradise.",
            "circlet_description": "A mask once covered in gold leaf. Perhaps it is a relic from some ancient officer of the legions.",
            "flower_name": "Harmonious Symphony Prelude",
            "feather_name": "Ancient Sea's Nocturnal Musing",
            "sand_name": "The Grand Jape of the Turning of Fate",
            "goblet_name": "Ichor Shower Rhapsody",
            "circlet_name": "Whimsical Dance of the Withered",
            "two_pc_bonus": "ATK +18%",
            "four_pc_bonus": "When the value of a Bond of Life increases or decreases, this character deals 18% increased DMG for 6s. Max 3 stacks.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 4.6
        },
        {
            "name": "Gambler",
            "key": "gambler",
            "flower_description": "A big, luxurious flower that can hide a loaded dice.",
            "feather_description": "The tail feather of a large bird. Perfect for discretely concealing a trump card.",
            "sand_description": "A shattered pocket watch that once took a lethal hit for its owner.",
            "goblet_description": "This vessel was specially made for a single purpose. It has absolutely no secret compartments built into it.",
            "circlet_description": "A pair of blue earrings that, when worn, calm the mind and encourage a rational assessment of risks.",
            "flower_name": "Gambler's Brooch",
            "feather_name": "Gambler's Feather Accessory",
            "sand_name": "Gambler's Pocket Watch",
            "goblet_name": "Gambler's Dice Cup",
            "circlet_name": "Gambler's Earrings",
            "two_pc_bonus": "Increases Elemental Skill DMG by 20%.",
            "four_pc_bonus": "Defeating an opponent has a 100% chance to remove Elemental Skill CD. Can only occur once every 15s.",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Gilded Dreams",
            "key": "gilded-dreams",
            "flower_description": "A flower bud made of hammered dark gold. Its crimson core is wrapped by petals that shall never open.",
            "feather_description": "This special feather was once used to weigh the hearts of the guilty, but it has since lost its original function.",
            "sand_description": "This dark-golden sundial seems to tell the ancient tale of the desert.",
            "goblet_description": "A wine cup that was once used at a grand and ancient feast. It has now lost much of that luster.",
            "circlet_description": "This gold-inlaid headband was once used by desert priests in the days of old. They were made in imitation of one worn by a legendary ruler of the desert peoples.",
            "flower_name": "Dreaming Steelbloom",
            "feather_name": "Feather of Judgment",
            "sand_name": "The Sunken Years",
            "goblet_name": "Honeyed Final Feast",
            "circlet_name": "Shadow of the Sand King",
            "two_pc_bonus": "Increases Elemental Mastery by 80.",
            "four_pc_bonus": "Within 8s of triggering an Elemental Reaction, the character equipping this will obtain buffs based on the Elemental Type of the other party members. ATK is increased by 14% for each party member whose Elemental Type is the same as the equipping character, and Elemental Mastery is increased by 50 for every party member with a different Elemental Type. Each of the aforementioned buffs will count up to 3 characters. This effect can be triggered once every 8s. The character who equips this can still trigger its effects when not on the field.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 3.0
        },
        {
            "name": "Gladiator's Finale",
            "key": "gladiators-finale",
            "flower_description": "No one knows why the legendary gladiator wore this flower on his chest. It was the brutal warrior's only weakness.",
            "feather_description": "A feather of dreams that soars free like an eagle. At the end of the gladiator's legendary life, this parting gift was left upon his chest by a bird that knew true freedom.",
            "sand_description": "A timepiece that recorded the gladiator's days in the bloodstained Colosseum. To him, it counted down the days on his long road to freedom.",
            "goblet_description": "The golden cup a champion gladiator drank from in ancient times. It brimmed with his glory for years until the fateful day of his fall.",
            "circlet_description": "The helmet of a legendary gladiator from ancient times, who would proudly stretch out his bloodied arms to welcome the thunderous applause of his audience.",
            "flower_name": "Gladiator's Nostalgia",
            "feather_name": "Gladiator's Destiny",
            "sand_name": "Gladiator's Longing",
            "goblet_name": "Gladiator's Intoxication",
            "circlet_name": "Gladiator's Triumphus",
            "two_pc_bonus": "ATK +18%.",
            "four_pc_bonus": "If the wielder of this artifact set uses a Sword, Claymore or Polearm, increases their Normal Attack DMG by 35%.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.0
        },
        {
            "name": "Golden Troupe",
            "key": "golden-troupe",
            "flower_description": "A flower constructed out of clam, mother-of-pearl, and gold leaf. It blooms proudly.",
            "feather_description": "A gold feather made using silver and gold filigree. A crystal-clear sapphire is mounted atop it.",
            "sand_description": "This lovely sundial is inlaid with silver and gold. It seems that time has stopped flowing atop its dial plate.",
            "goblet_description": "An ancient silver urn that was once filled with fine wine as red as rubies. Now, it contains nothing but bitter seawater.",
            "circlet_description": "An ancient crown that resembles a stage prop more than it does some suzerain's headgear.",
            "flower_name": "Golden Song's Variation",
            "feather_name": "Golden Bird's Shedding",
            "sand_name": "Golden Era's Prelude",
            "goblet_name": "Golden Night's Bustle",
            "circlet_name": "Golden Troupe's Reward",
            "two_pc_bonus": "Increases Elemental Skill DMG by 20%.",
            "four_pc_bonus": "Increases Elemental Skill DMG by 25%. Additionally, when not on the field, Elemental Skill DMG will be further increased by 25%. This effect will be cleared 2s after taking the field.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 4.0
        },
        {
            "name": "Heart of Depth",
            "key": "heart-of-depth",
            "flower_description": "A mantle brooch that has lost its luster. The gold plating that once adorned it was ground away by the wind and the waves long ago.",
            "feather_description": "A feather carried over by whimpering sea winds and crimson waves. The passage of time has changed its shape and color.",
            "sand_description": "An ancient bronze compass. Its needle points towards some ever-distant shore, to a non-existent harbor.",
            "goblet_description": "A faded wine cup that was unintentionally dredged up from the sea. Its dull exterior tells of the days it has spent beneath the waves.",
            "circlet_description": "An ancient, wine-stained sea hat that still reeks of alcohol even now.",
            "flower_name": "Gilded Corsage",
            "feather_name": "Gust of Nostalgia",
            "sand_name": "Copper Compass",
            "goblet_name": "Goblet of Thundering Deep",
            "circlet_name": "Wine-Stained Tricorne",
            "two_pc_bonus": "Hydro DMG Bonus +15%",
            "four_pc_bonus": "After using an Elemental Skill, increases Normal Attack and Charged Attack DMG by 30% for 15s.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.2
        },
        {
            "name": "Husk of Opulent Dreams",
            "key": "husk-of-opulent-dreams",
            "flower_description": "A small golden ornament with six petals that shall never wilt. It symbolizes the transience of mortal glories.",
            "feather_description": "A feather-shaped token that was brought forth from a secluded hall. The compassion of its creator led to it being left within that mansion along with a certain slumbering form.",
            "sand_description": "As far as Inazuma is concerned, this is some small object from overseas. The heart of this mechanism has been removed, and its hands no longer turn.",
            "goblet_description": "A gourd that has been adorned with powdered gold and black paint. Its original color can no longer be discerned, but its main use seems to be as a performance prop.",
            "circlet_description": "A hat that once shielded a wanderer from sun and rain. It eventually became a convenient tool with which faces might be hidden and expressions obscured.",
            "flower_name": "Bloom Times",
            "feather_name": "Plume of Luxury",
            "sand_name": "Song of Life",
            "goblet_name": "Calabash of Awakening",
            "circlet_name": "Skeletal Hat",
            "two_pc_bonus": "DEF +30%",
            "four_pc_bonus": "A character equipped with this Artifact set will obtain the Curiosity effect in the following conditions:When on the field, the character gains 1 stack after hitting an opponent with a Geo attack, triggering a maximum of once every 0.3s.When off the field, the character gains 1 stack every 3s.Curiosity can stack up to 4 times, each providing 6% DEF and a 6% Geo DMG Bonus.When 6 seconds pass without gaining a Curiosity stack, 1 stack is lost.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 2.3
        },
        {
            "name": "Initiate",
            "key": "initiate",
            "flower_description": "A small flower. Cute and adorable, just like the early spring of North Teyvat.",
            "feather_description": "An item attached to the grip of a traveler's first sword, bearing the modest dreams of its wielder.",
            "sand_description": "",
            "goblet_description": "",
            "circlet_description": "",
            "flower_name": "Initiate's Flower",
            "feather_name": "Initiate's Feather",
            "sand_name": "",
            "goblet_name": "",
            "circlet_name": "",
            "two_pc_bonus": "",
            "four_pc_bonus": "",
            "rarity_min": 1,
            "rarity_max": 1,
            "release_version": 1.0
        },
        {
            "name": "Instructor",
            "key": "instructor",
            "flower_description": "Whenever the instructor wore this brooch, it meant there would be no training sessions that day.",
            "feather_description": "Any instructor who has mastered the art of de-escalation knows to keep this accessory firmly in their grasp at all times.",
            "sand_description": "A stopwatch used not for general timekeeping but to measure the duration of a training session.",
            "goblet_description": "It may seem like an ordinary tea cup to most. But to students, it is the symbol of the instructor's authority.",
            "circlet_description": "A standard-issue honorary instructor's cap, only granted to those who turn down a promotion.",
            "flower_name": "Instructor's Brooch",
            "feather_name": "Instructor's Feather Accessory",
            "sand_name": "Instructor's Pocket Watch",
            "goblet_name": "Instructor's Tea Cup",
            "circlet_name": "Instructor's Cap",
            "two_pc_bonus": "Increases Elemental Mastery by 80.",
            "four_pc_bonus": "Upon triggering an Elemental Reaction, increases all party members' Elemental Mastery by 120 for 8s.",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Lavawalker",
            "key": "lavawalker",
            "flower_description": "A flower that blooms amidst burning flames. It is said that long ago, a sage once wore it as he walked into a sea of fire.",
            "feather_description": "The feather of a proud phoenix. You can almost hear the sound of its wings flapping in the scorching flames.",
            "sand_description": "Burning sand flows within this hourglass. Despite the intense heat, the sand leave no mark upon the vessel that houses it.",
            "goblet_description": "A legendary goblet that can withstand extremely high temperatures. It still retains a degree of warmth even though it is now empty.",
            "circlet_description": "The circlet of a sage who traversed a sea of fire. It once shone brightly from their ancient silhouette as they stood strong amidst the flames.",
            "flower_name": "Lavawalker's Resolution",
            "feather_name": "Lavawalker's Salvation",
            "sand_name": "Lavawalker's Torment",
            "goblet_name": "Lavawalker's Epiphany",
            "circlet_name": "Lavawalker's Wisdom",
            "two_pc_bonus": "Pyro RES increased by 40%.",
            "four_pc_bonus": "Increases DMG against opponents affected by Pyro by 35%.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.0
        },
        {
            "name": "Long Night's Oath",
            "key": "long-nights-oath",
            "flower_description": "A metal flower that was worn by the Ratniki. It symbolizes the oath of eternal vigilance taken by its original owner.",
            "feather_description": "A hat ornament intricately crafted from the feathers of a nightingale. They say that its form was first conceived by the original Torchforger.",
            "sand_description": "A bronze bell that was carried by a warrior who walked through the dark abyss. Its peal can be heard on pitch-black nights.",
            "goblet_description": "A horn that was once used to summon those who had sworn oaths. It has long since lost its purpose.",
            "circlet_description": "An ancient heavy helmet. It is an heirloom that bears the mark of a venerable lineage of northern warriors.",
            "flower_name": "Lightkeeper's Pledge",
            "feather_name": "Nightingale's Tail Feather",
            "sand_name": "Undying One's Mourning Bell",
            "goblet_name": "A Horn Unwinded",
            "circlet_name": "Dyed Tassel",
            "two_pc_bonus": "Plunging Attack DMG increased by 25%.",
            "four_pc_bonus": "After the equipping character's Plunging Attack/Charged Attack/Elemental Skill hits an opponent, they will gain 1/2/2 stack(s) of \"Radiance Everlasting.\" Plunging Attacks, Charged Attacks or Elemental Skills can each trigger this effect once every 1s. Radiance Everlasting: Plunging Attacks deal 15%. increased DMG for 6s. Max 5 stacks. Each stack's duration is counted independently.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 5.5
        },
        {
            "name": "Lucky Dog",
            "key": "lucky-dog",
            "flower_description": "A four-leaf clover that grows in the wild. It was picked because it is said to bring good luck.",
            "feather_description": "A monster once cornered an adventurer, but was then picked off by a hunting eagle... That eagle dropped this feather, which now carries some of the adventurer's good luck.",
            "sand_description": "A broken hourglass from which all the sand has escaped. But it's fine, because the passage of time means nothing to someone without a single worry in the whole world.",
            "goblet_description": "An exquisite metallic vessel that was once used to knock out a thief.",
            "circlet_description": "Its former owner once fell into a cave and found the treasure trove of an exiled royal. This is a souvenir from that incident.",
            "flower_name": "Lucky Dog's Clover",
            "feather_name": "Lucky Dog's Eagle Feather",
            "sand_name": "Lucky Dog's Hourglass",
            "goblet_name": "Lucky Dog's Goblet",
            "circlet_name": "Lucky Dog's Silver Circlet",
            "two_pc_bonus": "DEF increased by 100.",
            "four_pc_bonus": "Picking up Mora restores 300 HP.",
            "rarity_min": 1,
            "rarity_max": 3,
            "release_version": 1.0
        },
        {
            "name": "Maiden Beloved",
            "key": "maiden-beloved",
            "flower_description": "A fragrant flower that will bloom for all eternity and never wither.",
            "feather_description": "A feathered accessory that carries the longing for a certain someone, like a migratory bird on the wind.",
            "sand_description": "The hands of time will never come to an end, but the same cannot be said for those cherished years of the young maiden's life when she was doted upon.",
            "goblet_description": "A vessel made with sweet black tea in mind rather than bitter liquor.",
            "circlet_description": "A meticulously well-maintained woman's hat that keeps wrinkles safely out of sight.",
            "flower_name": "Maiden's Distant Love",
            "feather_name": "Maiden's Heart-Stricken Infatuation",
            "sand_name": "Maiden's Passing Youth",
            "goblet_name": "Maiden's Fleeting Leisure",
            "circlet_name": "Maiden's Fading Beauty",
            "two_pc_bonus": "Character Healing Effectiveness +15%",
            "four_pc_bonus": "Using an Elemental Skill or Burst increases healing received by all party members by 20% for 10s.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.0
        },
        {
            "name": "Marechaussee Hunter",
            "key": "marechaussee-hunter",
            "flower_description": "An ancient emblem that was once awarded to those who had made exceptional contributions in battle.",
            "feather_description": "A portable tool used to adjust the torque on some old-school clockwork machine. It has since lost its practical value.",
            "sand_description": "A standard pocket watch. Its accuracy is not particularly high.",
            "goblet_description": "A portable metal vessel containing strong wine. Can be stuffed into the pocket of an outer coat for ease of access and use.",
            "circlet_description": "An old mask that can, to some extent, stand in for a face marred by wounds. Its design can vary based on the wounded areas and the user's gender.",
            "flower_name": "Hunter's Brooch",
            "feather_name": "Masterpiece's Overture",
            "sand_name": "Moment of Judgment",
            "goblet_name": "Forgotten Vessel",
            "circlet_name": "Veteran's Visage",
            "two_pc_bonus": "Normal and Charged Attack DMG +15%.",
            "four_pc_bonus": "When current HP increases or decreases, CRIT Rate will be increased by 12% for 5s. Max 3 stacks.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 4.0
        },
        {
            "name": "Martial Artist",
            "key": "martial-artist",
            "flower_description": "This particular kind of red flower was the only thing that could alleviate the Martial Artist's pain.",
            "feather_description": "A common bird feather. Experts use it to practice strength control, while rookies use it to make fans.",
            "sand_description": "A tool to keep track of time in endurance training. It is more accurate and reliable than a regular hourglass.",
            "goblet_description": "A rather exquisite wine cup used in pre-combat rituals.",
            "circlet_description": "The first lesson as an apprentice: Vigor, Strength, Will. These words are written on the bandana so you'll never forget them.",
            "flower_name": "Martial Artist's Red Flower",
            "feather_name": "Martial Artist's Feather Accessory",
            "sand_name": "Martial Artist's Water Hourglass",
            "goblet_name": "Martial Artist's Wine Cup",
            "circlet_name": "Martial Artist's Bandana",
            "two_pc_bonus": "Normal and Charged Attack DMG +15%",
            "four_pc_bonus": "After using Elemental Skill, increases Normal Attack and Charged Attack DMG by 25% for 8s.",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Nighttime Whispers in the Echoing Woods",
            "key": "nighttime-whispers-in-the-echoing-woods",
            "flower_description": "A brooch that the witch in the tale wore. As with the other ornaments she loved, this was characterized by butterfly-like shapes.",
            "feather_description": "The witch in the tale used this dip pen. Among its various advantages, its silky-smooth writing is the least worthy of mention.",
            "sand_description": "A sand timepiece that the witch relied on in the story. Legend has it that if you recite the wrong incantation over it, time will suddenly flow exceptionally quickly.",
            "goblet_description": "An ink bottle utilized by the witch in the story. It possesses a strange enchantment no less powerful than the one cast upon the dip pen.",
            "circlet_description": "The lady's hat favored by the witch in the story. She loved this piece of headwear for how it weaves together solemnity and playfulness.",
            "flower_name": "Selfless Floral Accessory",
            "feather_name": "Honest Quill",
            "sand_name": "Faithful Hourglass",
            "goblet_name": "Magnanimous Ink Bottle",
            "circlet_name": "Compassionate Ladies' Hat",
            "two_pc_bonus": "ATK +18%",
            "four_pc_bonus": "After using an Elemental Skill, gain a 20% Geo DMG Bonus for 10s. While under a shield granted by the Crystallize reaction, the above effect will be increased by 150%, and this additional increase disappears 1s after that shield is lost.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 4.3
        },
        {
            "name": "Noblesse Oblige",
            "key": "noblesse-oblige",
            "flower_description": "A satin flower with a glossy finish, fit for an elegant gathering. It still looks as distinguished as it did on the day it was cast aside.",
            "feather_description": "A feathered hat accessory worn by the old aristocrats of Mondstadt on hunts. It still stands proudly as if no time has passed.",
            "sand_description": "A pocket watch that once belonged to the old aristocrats of Mondstadt. Passed down from generation to generation, it has witnessed many years of history.",
            "goblet_description": "An ornamental urn that once belonged to the old aristocrats of Mondstadt. Mournful winds seem to echo within its empty interior.",
            "circlet_description": "A masquerade mask worn by the old aristocrats of Mondstadt. Its hollow eyes are fixated on the golden days of the past.",
            "flower_name": "Royal Flora",
            "feather_name": "Royal Plume",
            "sand_name": "Royal Pocket Watch",
            "goblet_name": "Royal Silver Urn",
            "circlet_name": "Royal Masque",
            "two_pc_bonus": "Elemental Burst DMG +20%",
            "four_pc_bonus": "Using an Elemental Burst increases all party members' ATK by 20% for 12s. This effect cannot stack.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.0
        },
        {
            "name": "Nymph's Dream",
            "key": "nymphs-dream",
            "flower_description": "The story must end, and even fresh flowers will wither. But the flower within one's dreams will always remain in full and fragrant bloom.",
            "feather_description": "This was once a decorative feather in someone's hat. Being dark green, it is quite eye-catching indeed.",
            "sand_description": "A pocket watch that has long stopped working. It seems to have borne witness to many a passing year as its hands spun in vain.",
            "goblet_description": "A lovely teacup. Perhaps it was once used by people enjoying a leisurely afternoon together.",
            "circlet_description": "An exquisitely-made monocle. Ancient anecdotes say that one might be able to see the future through it.",
            "flower_name": "Odyssean Flower",
            "feather_name": "Wicked Mage's Plumule",
            "sand_name": "Nymph's Constancy",
            "goblet_name": "Heroes' Tea Party",
            "circlet_name": "Fell Dragon's Monocle",
            "two_pc_bonus": "Hydro DMG Bonus +15%",
            "four_pc_bonus": "After Normal, Charged, and Plunging Attacks, Elemental Skills, and Elemental Bursts hit opponents, 1 stack of Mirrored Nymph will triggered, lasting 8s. When under the effect of 1, 2, or 3 or more Mirrored Nymph stacks, ATK will be increased by 7%/16%/25%, and Hydro DMG will be increased by 4%/9%/15%. Mirrored Nymph created by Normal, Charged, and Plunging Attacks, Elemental Skills, and Elemental Bursts exist independently.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 3.6
        },
        {
            "name": "Obsidian Codex",
            "key": "obsidian-codex",
            "flower_description": "A flower meticulously carved from black crystal. It emits a mysterious light at night.",
            "feather_description": "A feathered accessory made in imitation of an ancient dragon's wing. Perhaps it was once a memento of some forgotten history.",
            "sand_description": "A mysterious ritual element that is neither a timepiece nor a compass. Nowadays, no one has any idea what it is used for.",
            "goblet_description": "A vessel that seems to have been made by twisting and forming stone in a seemingly whimsical fashion. But it is an open question as to who possesses such strength...",
            "circlet_description": "A crown made of obsidian that in ancient times was used in coronation ceremonies by noble tribal kings.",
            "flower_name": "Reckoning of the Xenogenic",
            "feather_name": "Root of the Spirit-Marrow",
            "sand_name": "Myths of the Night Realm",
            "goblet_name": "Pre-Banquet of the Contenders",
            "circlet_name": "Crown of the Saints",
            "two_pc_bonus": "While the equipping character is in Nightsoul's Blessing and is on the field, their DMG dealt is increased by 15%.",
            "four_pc_bonus": "After the equipping character consumes 1 Nightsoul point while on the field, CRIT Rate increases by 40% for 6s. This effect can trigger once every second.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 5.0
        },
        {
            "name": "Ocean-Hued Clam",
            "key": "ocean-hued-clam",
            "flower_description": "A soft flower that has taken on the many shades of the capricious ocean. It shines with wondrous colors under the moon's silver light.",
            "feather_description": "A down feather with the same hue as coral, said to come from a shrine maiden's ceremonial garment.",
            "sand_description": "A clean, flawless shell that comes from the bottomless ocean.",
            "goblet_description": "The shining pearls that the shrine maidens of Watatsumi Island offer up shine eternally and never dim.",
            "circlet_description": "An ancient, intricate crown that was once used by a forgotten clergy member. Today, this relic has been enshrined with great ceremony by the people of Watatsumi.",
            "flower_name": "Sea-Dyed Blossom",
            "feather_name": "Deep Palace's Plume",
            "sand_name": "Cowry of Parting",
            "goblet_name": "Pearl Cage",
            "circlet_name": "Crown of Watatsumi",
            "two_pc_bonus": "Healing Bonus +15%.",
            "four_pc_bonus": "When the character equipping this artifact set heals a character in the party, a Sea-Dyed Foam will appear for 3 seconds, accumulating the amount of HP recovered from healing (including overflow healing).At the end of the duration, the Sea-Dyed Foam will explode, dealing DMG to nearby opponents based on 90% of the accumulated healing.(This DMG is calculated similarly to Reactions such as Electro-Charged, and Superconduct, but it is not affected by Elemental Mastery, Character Levels, or Reaction DMG Bonuses).Only one Sea-Dyed Foam can be produced every 3.5 seconds.Each Sea-Dyed Foam can accumulate up to 30,000 HP (including overflow healing).There can be no more than one Sea-Dyed Foam active at any given time.This effect can still be triggered even when the character who is using this artifact set is not on the field.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 2.3
        },
        {
            "name": "Pale Flame",
            "key": "pale-flame",
            "flower_description": "A hard, blue artificial flower. Its petals shall never wither, nor shall its colors fade.",
            "feather_description": "An ominous pinion with edges of unsurpassed keenness. Perhaps it represents an unnaturally uninhibited nature.",
            "sand_description": "A pocket watch with a cover that cannot be opened. Yet it ticks and tocks away, following the inexorable flow of time.",
            "goblet_description": "An intricately-made cup. Its appearance betrays nothing of its age to an observer.",
            "circlet_description": "A mask that covers the face, hiding one's expression from others.",
            "flower_name": "Stainless Bloom",
            "feather_name": "Wise Doctor's Pinion",
            "sand_name": "Moment of Cessation",
            "goblet_name": "Surpassing Cup",
            "circlet_name": "Mocking Mask",
            "two_pc_bonus": "Physical DMG Bonus +25%",
            "four_pc_bonus": "When an Elemental Skill hits an opponent, ATK is increased by 9% for 7s. This effect stacks up to 2 times and can be triggered once every 0.3s. Once 2 stacks are reached, the 2-set effect is increased by 100%.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.5
        },
        {
            "name": "Prayers for Destiny",
            "key": "prayers-for-destiny",
            "flower_description": "A tiara worn by those tasked with offering sacrifices in ancient times. Because it was submerged in water year in and year out, it possesses remarkable resistance.",
            "feather_description": "",
            "sand_description": "",
            "goblet_description": "",
            "circlet_description": "",
            "flower_name": "",
            "feather_name": "",
            "sand_name": "",
            "goblet_name": "",
            "circlet_name": "Tiara of Torrents",
            "two_pc_bonus": "",
            "four_pc_bonus": "",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Prayers for Illumination",
            "key": "prayers-for-illumination",
            "flower_description": "A tiara worn by those tasked with offering sacrifices in ancient times. After being subjected to the dancing sacrificial flames year in and year out, it possesses remarkable resistance.",
            "feather_description": "",
            "sand_description": "",
            "goblet_description": "",
            "circlet_description": "",
            "flower_name": "",
            "feather_name": "",
            "sand_name": "",
            "goblet_name": "",
            "circlet_name": "Tiara of Flame",
            "two_pc_bonus": "",
            "four_pc_bonus": "",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Prayers for Wisdom",
            "key": "prayers-for-wisdom",
            "flower_description": "A tiara worn by those tasked with offering sacrifices in ancient times. Because it harkened the call of thunder year in and year out, it possesses remarkable resistance.",
            "feather_description": "",
            "sand_description": "",
            "goblet_description": "",
            "circlet_description": "",
            "flower_name": "",
            "feather_name": "",
            "sand_name": "",
            "goblet_name": "",
            "circlet_name": "Tiara of Thunder",
            "two_pc_bonus": "",
            "four_pc_bonus": "",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Prayers to Springtime",
            "key": "prayers-to-springtime",
            "flower_description": "A tiara worn by those tasked with offering sacrifices in ancient times. Because it once weathered years of icy cold, it possesses remarkable resistance.",
            "feather_description": "",
            "sand_description": "",
            "goblet_description": "",
            "circlet_description": "",
            "flower_name": "",
            "feather_name": "",
            "sand_name": "",
            "goblet_name": "",
            "circlet_name": "Tiara of Frost",
            "two_pc_bonus": "",
            "four_pc_bonus": "",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Resolution of Sojourner",
            "key": "resolution-of-sojourner",
            "flower_description": "A small cerulean flower with somebody's ribbon pinned to the stem.",
            "feather_description": "A blue arrow fletching imbued with the sentiment of travelers that had once faded into the horizon.",
            "sand_description": "A sundial that has survived the ages, always silently recording the cycles of the sun and moon as they pass through the sky.",
            "goblet_description": "A plain porcelain goblet that was once brimming with joyous brews.",
            "circlet_description": "A reed coronet that emanates the spring breeze.",
            "flower_name": "Heart of Comradeship",
            "feather_name": "Feather of Homecoming",
            "sand_name": "Sundial of the Sojourner",
            "goblet_name": "Goblet of the Sojourner",
            "circlet_name": "Crown of Parting",
            "two_pc_bonus": "ATK +18%.",
            "four_pc_bonus": "Increases Charged Attack CRIT Rate by 30%.",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Retracing Bolide",
            "key": "retracing-bolide",
            "flower_description": "A man-made flower in eternal bloom. Who knows if there truly is life in there?",
            "feather_description": "A well-crafted wooden dart. It will only stop once it has reached its destination.",
            "sand_description": "A pocketwatch that has stopped at a certain point in time.",
            "goblet_description": "Water balloons can be seen everywhere during the summer festival, but none are as finely-wrought as this one.",
            "circlet_description": "A popular mask cast in the image of a deity, as described in the legends.",
            "flower_name": "Summer Night's Bloom",
            "feather_name": "Summer Night's Finale",
            "sand_name": "Summer Night's Moment",
            "goblet_name": "Summer Night's Waterballoon",
            "circlet_name": "Summer Night's Mask",
            "two_pc_bonus": "Increases Shield Strength by 35%.",
            "four_pc_bonus": "While protected by a shield, gain an additional 40% Normal and Charged Attack DMG.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.0
        },
        {
            "name": "Scholar",
            "key": "scholar",
            "flower_description": "A dried flower used as a bookmark, it had absorbed the scent from the pages.",
            "feather_description": "A bird's feather that serves as a quill pen, the tip has long been stained black.",
            "sand_description": "A small desktop clock, whose former owner was a scholar sat in a windowless room buried in books. This was probably the only reference they had to the time of day.",
            "goblet_description": "Originally designed to hold drinking water, this cup was stained black after a scholar used it to wash their paint brushes.",
            "circlet_description": "This corrective lens helped restore the vision of one whose eyes were damaged from intensive studying.",
            "flower_name": "Scholar's Bookmark",
            "feather_name": "Scholar's Quill Pen",
            "sand_name": "Scholar's Clock",
            "goblet_name": "Scholar's Ink Cup",
            "circlet_name": "Scholar's Lens",
            "two_pc_bonus": "Energy Recharge +20%",
            "four_pc_bonus": "Gaining Elemental Particles or Orbs gives 3 Energy to all party members who have a bow or a catalyst equipped. Can only occur once every 3s.",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Scroll of the Hero of Cinder City",
            "key": "scroll-of-the-hero-of-cinder-city",
            "flower_description": "A flower carved from flint and Drakite, signifying that its bearer is qualified to become a beast tamer.",
            "feather_description": "A signal used by mountain rangers to mark out paths. Their bird-feather shapes make them very eye-catching indeed.",
            "sand_description": "A golden disc shaped like a sun. The draconic patterns on it seem to symbolize the cycle of life and death.",
            "goblet_description": "A strange goblet strikingly similar in shape to a dragon's claw. Its maker must have made it with something special in mind.",
            "circlet_description": "A feather mask with falcon-esque plumage. Many legends surround this object.",
            "flower_name": "Beast Tamer's Talisman",
            "feather_name": "Mountain Ranger's Marker",
            "sand_name": "Mystic's Gold Dial",
            "goblet_name": "Wandering Scholar's Claw Cup",
            "circlet_name": "Demon-Warrior's Feather Mask",
            "two_pc_bonus": "When a nearby party member triggers a Nightsoul Burst, the equipping character regenerates 6 Elemental Energy.",
            "four_pc_bonus": "After the equipping character triggers a reaction related to their Elemental Type, all nearby party members gain a 12% Elemental DMG Bonus for the Elemental Types involved in the elemental reaction for 15s. If the equipping character is in the Nightsoul's Blessing state when triggering this effect, all nearby party members gain an additional 28% Elemental DMG Bonus for the Elemental Types involved in the elemental reaction for 20s. The equipping character can trigger this effect while off-field, and the DMG bonus from Artifact Sets with the same name do not stack.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 5.0
        },
        {
            "name": "Shimenawa's Reminiscence",
            "key": "shimenawas-reminiscence",
            "flower_description": "A lovely amulet made from twisted paper cord. It is said to hold the power to make wishes come true.",
            "feather_description": "A demon-slaying arrow of a rather ancient make. It seems to have been preserved with great care by someone, even until the present day.",
            "sand_description": "A bronze pocket watch adorned with twisted paper cord and a bell. Its hands are forever frozen at the dawn of a certain autumn day.",
            "goblet_description": "A special fortune-telling cylindrical object. The mechanism at the bottom allows one to easily remove all unwanted wish sticks.",
            "circlet_description": "A well-preserved ceremonial fox mask. A small, enigmatic smile ever graces its lips.",
            "flower_name": "Entangling Bloom",
            "feather_name": "Shaft of Remembrance",
            "sand_name": "Morning Dew's Moment",
            "goblet_name": "Hopeful Heart",
            "circlet_name": "Capricious Visage",
            "two_pc_bonus": "ATK +18%",
            "four_pc_bonus": "When casting an Elemental Skill, if the character has 15 or more Energy, they lose 15 Energy and Normal/Charged/Plunging Attack DMG is increased by 50% for 10s. This effect will not trigger again during that duration.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 2.0
        },
        {
            "name": "Song of Days Past",
            "key": "song-of-days-past",
            "flower_description": "An ever-blooming flower shaped from larimar and shimmering silver. They say that this is still viewed as a symbol of resistance.",
            "feather_description": "A butterfly-shaped feather accessory made from silver and azure crystals. It is said to, in the distant past, have symbolized an oath to never be parted.",
            "sand_description": "An oddly shaped hourglass made from lazurite and aqua jade. It was reportedly inspired by the bell tower in Petrichor.",
            "goblet_description": "An opulent vessel made based on the form of the legendary \"Pure Grail.\" It is said to be able to fulfill the wishes of the purest of people.",
            "circlet_description": "A formal hat that was once in vogue amongst creators of opera in Fontaine. Word has it that its feathered adornment was based on the legendary helms of the Lochknights.",
            "flower_name": "Forgotten Oath of Days Past",
            "feather_name": "Recollection of Days Past",
            "sand_name": "Echoing Sound From Days Past",
            "goblet_name": "Promised Dream of Days Past",
            "circlet_name": "Poetry of Days Past",
            "two_pc_bonus": "Healing Bonus +15%",
            "four_pc_bonus": "When the equipping character heals a party member, the Yearning effect will be created for 6s, which records the total amount of healing provided (including overflow healing). When the duration expires, the Yearning effect will be transformed into the \"Waves of Days Past\" effect: When your active party member hits an opponent with a Normal Attack, Charged Attack, Plunging Attack, Elemental Skill, or Elemental Burst, the DMG dealt will be increased by 8% of the total healing amount recorded by the Yearning effect. The \"Waves of Days Past\" effect is removed after it has taken effect 5 times or after 10s. A single instance of the Yearning effect can record up to 15,000 healing, and only a single instance can exist at once, but it can record the healing from multiple equipping characters. Equipping characters on standby can still trigger this effect.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 4.3
        },
        {
            "name": "Tenacity of the Millelith",
            "key": "tenacity-of-the-millelith",
            "flower_description": "A flower made from gold leaf. It represents the glories and honors attained by its wearer.",
            "feather_description": "A falcon feather worn on ceremonial occasions. It displays the dignity and resolve of Liyue Harbor to the outside world.",
            "sand_description": "A simple device for telling time. This was once standard-issue for the Millelith during times of war.",
            "goblet_description": "A golden cup used by the Millelith to take their oaths. Still bears the lovely scent of wine.",
            "circlet_description": "A splendorous helmet from ages past. Clean the dust away and it will look brand-new once more.",
            "flower_name": "Flower of Accolades",
            "feather_name": "Ceremonial War-Plume",
            "sand_name": "Orichalceous Time-Dial",
            "goblet_name": "Noble's Pledging Vessel",
            "circlet_name": "General's Ancient Helm",
            "two_pc_bonus": "HP +20%",
            "four_pc_bonus": "When an Elemental Skill hits an opponent, the ATK of all nearby party members is increased by 20% and their Shield Strength is increased by 30% for 3s. This effect can be triggered once every 0.5s. This effect can still be triggered even when the character who is using this artifact set is not on the field.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.5
        },
        {
            "name": "The Exile",
            "key": "the-exile",
            "flower_description": "A withered flower worn on the shirt. Its former owner insisted on wearing it even in exile, so it must mean something.",
            "feather_description": "Not an actual accessory per se. Just a random bird feather that was found somewhere in the wilderness by the exile.",
            "sand_description": "Even after the crystal watch face was shattered and the hands lost, its former owner kept it until the end.",
            "goblet_description": "A dull goblet made of a heavy metal. It was once inlaid with gemstones, but they have since been stripped off.",
            "circlet_description": "A prestigious circlet. However, the royal insignia has been scratched out, and it is no longer the symbol of distinguished status that it once was.",
            "flower_name": "Exile's Flower",
            "feather_name": "Exile's Feather",
            "sand_name": "Exile's Pocket Watch",
            "goblet_name": "Exile's Goblet",
            "circlet_name": "Exile's Circlet",
            "two_pc_bonus": "Energy Recharge +20%",
            "four_pc_bonus": "Using an Elemental Burst regenerates 2 Energy for all party members (excluding the wearer) every 2s for 6s. This effect cannot stack.",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Thundering Fury",
            "key": "thundering-fury",
            "flower_description": "A lightning-infused flower, somehow spared the fate of being trodden underfoot or reduced to ash by the furious purple fire, making it the sole survivor on the day of disaster.",
            "feather_description": "A lightning-charged feather that still flickers with the wrath of the Thunderbird's cruel retribution.",
            "sand_description": "The hourglass used to foretell the coming of the Thunderbird by the tribe that worshiped it. It has fallen into eternal silence now that the tribe is no more.",
            "goblet_description": "A ceremonial cup that holds the blood of the innocent. It is brimming with the thundering fury of the prayers that echo within.",
            "circlet_description": "A crown once worn by an ancient shaman who worshiped the Thunderbird. The capricious beast remained unmoved by the shaman's devotion.",
            "flower_name": "Thunderbird's Mercy",
            "feather_name": "Survivor of Catastrophe",
            "sand_name": "Hourglass of Thunder",
            "goblet_name": "Omen of Thunderstorm",
            "circlet_name": "Thunder Summoner's Crown",
            "two_pc_bonus": "Electro DMG Bonus +15%",
            "four_pc_bonus": "Increases DMG caused by Overloaded, Electro-Charged, Superconduct, and Hyperbloom by 40%, and the DMG Bonus conferred by Aggravate is increased by 20%. When Quicken or the aforementioned Elemental Reactions are triggered, Elemental Skill CD is decreased by 1s. Can only occur once every 0.8s.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.0
        },
        {
            "name": "Thundersoother",
            "key": "thundersoother",
            "flower_description": "A flower that blooms even amidst ferocious thunder and lightning. To this day, it still grants courage to travelers in thunderstorms.",
            "feather_description": "The feather of a predatory bird that soars through lightning storms. It was said to have been adopted as an insignia by the legendary hero who pacified thunder and lightning.",
            "sand_description": "A timepiece kept by hero who conquered thunder and lightning. The tiny shard of Electro crystal within flow back and forth with the passing of time.",
            "goblet_description": "The wine goblet from which the Thundersoother, who defeated the Beast of Thunder, once drank violet lightning.",
            "circlet_description": "The crown given to the Thundersoother for defeating the Beast of Thunder that had been wreaking havoc upon the land.",
            "flower_name": "Thundersoother's Heart",
            "feather_name": "Thundersoother's Plume",
            "sand_name": "Hour of Soothing Thunder",
            "goblet_name": "Thundersoother's Goblet",
            "circlet_name": "Thundersoother's Diadem",
            "two_pc_bonus": "Electro RES increased by 40%.",
            "four_pc_bonus": "Increases DMG against opponents affected by Electro by 35%.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.0
        },
        {
            "name": "Tiny Miracle",
            "key": "tiny-miracle",
            "flower_description": "A flower that grew from a rock, breaking through the stone as it strove to reach the light.",
            "feather_description": "A feather from a bird of prey that flies almost too fast for the human eye to detect.",
            "sand_description": "Just an ordinary everyday hourglass. Turn it upside down and sure enough, the dry sand starts trickling down like water.",
            "goblet_description": "A cup commonly used for fortunetelling. It can also hold water, of course.",
            "circlet_description": "A cheap accessory that is actually made from ancient meteoric ore.",
            "flower_name": "Tiny Miracle's Flower",
            "feather_name": "Tiny Miracle's Feather",
            "sand_name": "Tiny Miracle's Hourglass",
            "goblet_name": "Tiny Miracle's Goblet",
            "circlet_name": "Tiny Miracle's Earrings",
            "two_pc_bonus": "All Elemental RES increased by 20%.",
            "four_pc_bonus": "Incoming Elemental DMG increases corresponding Elemental RES by 30% for 10s. Can only occur once every 10s.",
            "rarity_min": 3,
            "rarity_max": 4,
            "release_version": 1.0
        },
        {
            "name": "Traveling Doctor",
            "key": "traveling-doctor",
            "flower_description": "A precious medicinal ingredient that has lost all medicinal value after years in storage.",
            "feather_description": "The durable feather of an owl. Emblematic of nocturnal supremacy, it gave some encouragement to the Traveling Doctor when venturing out to visit patients late at night.",
            "sand_description": "A precise instrument used for keeping time. For a doctor, every second counts.",
            "goblet_description": "This pot used to carry concentrated and extremely potent concoctions. It is now empty, but still gives off a strong smell of medicine.",
            "circlet_description": "Used to tie back the doctor's hair when treating patients. Can also be used as a sling for sprains and broken arms in emergencies.",
            "flower_name": "Traveling Doctor's Silver Lotus",
            "feather_name": "Traveling Doctor's Owl Feather",
            "sand_name": "Traveling Doctor's Pocket Watch",
            "goblet_name": "Traveling Doctor's Medicine Pot",
            "circlet_name": "Traveling Doctor's Handkerchief",
            "two_pc_bonus": "Increases incoming healing by 20%.",
            "four_pc_bonus": "Using Elemental Burst restores 20% HP.",
            "rarity_min": 1,
            "rarity_max": 3,
            "release_version": 1.0
        },
        {
            "name": "Unfinished Reverie",
            "key": "unfinished-reverie",
            "flower_description": "A flower carved from grey stone covered with gold foil. Legends say that during a war, it was used to differentiate friend from foe.",
            "feather_description": "A tail feather ornament whose luster has long faded. The patterns on it are said to have been etched by the hand of a skilled artisan from long ago.",
            "sand_description": "A sundial used by an ancient kingdom to tell time. Tiny marks have been left at a certain scale that can only be seen through careful observation.",
            "goblet_description": "A three-legged cup. Once, many heroes were gathered around the bonfire, raising their cups high in toast and drinking their fill while discussing their wishes and ambitions.",
            "circlet_description": "A golden crown decorated with turquoise and emerald feathers, it has never been used in a coronation, living alone atop a velvet cushion.",
            "flower_name": "Dark Fruit of Bright Flowers",
            "feather_name": "Faded Emerald Tail",
            "sand_name": "Moment of Attainment",
            "goblet_name": "The Wine-Flask Over Which the Plan Was Hatched",
            "circlet_name": "Crownless Crown",
            "two_pc_bonus": "ATK +18%",
            "four_pc_bonus": "After leaving combat for 3s, DMG dealt increased by 50%. In combat, if no Burning opponents are nearby for more than 6s, this DMG Bonus will decrease by 10% per second until it reaches 0%. When a Burning opponent exists, it will increase by 10% instead until it reaches 50%. This effect still triggers if the equipping character is off-field.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 4.6
        },
        {
            "name": "Vermillion Hereafter",
            "key": "vermillion-hereafter",
            "flower_description": "An ancient memento. It still looks as alive as the being that preserved it several centuries ago.",
            "feather_description": "A dimly lustrous pinion steeped in strong memories.",
            "sand_description": "An ancient timepiece with a mighty solid look. Its luster is produced by sand crystal.",
            "goblet_description": "An old cup made of sand crystal. Its luster is somehow undimmed by age.",
            "circlet_description": "This mask is said to have been made by the mountain people for a Yaksha. It is of simple make, but its surface still shines brightly nonetheless.",
            "flower_name": "Flowering Life",
            "feather_name": "Feather of Nascent Light",
            "sand_name": "Solar Relic",
            "goblet_name": "Moment of the Pact",
            "circlet_name": "Thundering Poise",
            "two_pc_bonus": "ATK +18%.",
            "four_pc_bonus": "After using an Elemental Burst. this character will gain the Nascent Light effect, increasing their ATK by 8% for 16s. When the character's HP decreases, their ATK will further increase by 10%. This increase can occur this way maximum of 4 times. This effect can be triggered once every 0.8s. Nascent Light will be dispelled when the character leaves the field. If an Elemental Burst is used again during the duration of Nascent Light, the original Nascent Light will be dispelled.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 2.6
        },
        {
            "name": "Viridescent Venerer",
            "key": "viridescent-venerer",
            "flower_description": "A wild flower that was once a ubiquitous sight in its homeland. It was picked by a hunter who wore it on their chest.",
            "feather_description": "The fletching of an arrow that once pierced right through its prey, but somehow still remains spotless.",
            "sand_description": "A wondrous instrument that a hunter once wore. It forever points towards their prey.",
            "goblet_description": "A water pouch used by the Viridescent Venerer. Its capacity is much greater than one would expect.",
            "circlet_description": "A proud crown that once belonged to the Viridescent Venerer. It is as lush and green as the breezes of the wild.",
            "flower_name": "In Remembrance of Viridescent Fields",
            "feather_name": "Viridescent Arrow Feather",
            "sand_name": "Viridescent Venerer's Determination",
            "goblet_name": "Viridescent Venerer's Vessel",
            "circlet_name": "Viridescent Venerer's Diadem",
            "two_pc_bonus": "Anemo DMG Bonus +15%",
            "four_pc_bonus": "Increases Swirl DMG by 60%. Decreases opponent's Elemental RES to the element infused in the Swirl by 40% for 10s.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.0
        },
        {
            "name": "Vourukasha's Glow",
            "key": "vourukashas-glow",
            "flower_description": "An insignia in the shape of a lovely little flower that was once worn by pilgrims in times long bygone.",
            "feather_description": "An exquisite feather-shaped decoration on which the vivid hues of verdant leaves and fragrant flowers shimmer.",
            "sand_description": "An ancient timepiece upon which the light of Khvarena gleams. It is filled with a pure liquid that appears alive.",
            "goblet_description": "An opulent wine goblet that was once filled with nectar and honeydew, but is empty today.",
            "circlet_description": "Intricate and vibrant earrings upon which the luster of a hundred flowers seems to flow.",
            "flower_name": "Stamen of Khvarena's Origin",
            "feather_name": "Vibrant Pinion",
            "sand_name": "Ancient Abscission",
            "goblet_name": "Feast of Boundless Joy",
            "circlet_name": "Heart of Khvarena's Brilliance",
            "two_pc_bonus": "HP +20%",
            "four_pc_bonus": "Elemental Skill and Elemental Burst DMG will be increased by 10%. After the equipping character takes DMG, the aforementioned DMG Bonus is increased by 80% for 5s. This effect increase can have 5 stacks. The duration of each stack is counted independently. These effects can be triggered even when the equipping character is not on the field.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 3.6
        },
        {
            "name": "Wanderer's Troupe",
            "key": "wanderers-troupe",
            "flower_description": "A small flower-shaped insignia. If you listen carefully, you can almost hear a flute playing and voices singing.",
            "feather_description": "An azure arrow fletching that has neither faded nor splintered with the passage of time. The sound of running water seems to linger around it.",
            "sand_description": "An hourglass used to keep time during a band performance. It once made a crisp sound, but their performance has since ended.",
            "goblet_description": "An ancient, strangely-shaped canteen. The interior is fitted with harp strings, which plays a wondrous tune as the water flows out.",
            "circlet_description": "A top hat that has managed to retain its radiance despite braving the elements for time untold. An ancient tune still resonates within.",
            "flower_name": "Troupe's Dawnlight",
            "feather_name": "Bard's Arrow Feather",
            "sand_name": "Concert's Final Hour",
            "goblet_name": "Wanderer's String-Kettle",
            "circlet_name": "Conductor's Top Hat",
            "two_pc_bonus": "Increases Elemental Mastery by 80.",
            "four_pc_bonus": "Increases Charged Attack DMG by 35% if the character uses a Catalyst or Bow.",
            "rarity_min": 4,
            "rarity_max": 5,
            "release_version": 1.0
        }
    ]
}